producer_name_list_known = [
    '려', '포에버', 'HK', '오가니스트', 'SFC', '화이트', '제니코', '메디안', '서울F&B', '샘표',
    '46cm', '엘지', '글라소', '간만세', '샤프란', '동서', 'SNJ', 'MQ', '서울FB', '아귀채45G(냉장',
    '동화', '애경', '솜', '이가자연면', '칸타타', '정관장', '까떼도르', '불닭', '좋은', '아리아',
    '웅진', '마즈', '닥터세닥', '풀무원', 'CJ', 'SCD', '사조', '삼양사', '나무', '심플리쿡',
    '롯데푸드', '심쿡', '잘풀리는집3겹(27M*15롤', '케라시스', '미성', '일신', '가그린', '삼립', '나뚜루', '비원',
    '덴마크', '크리오', '맨담', '복어꼬리포30G(냉장', '파스퇴', '미닛', '네슬레', '광동', '천호', '한성',
    '미쟝센', '코카', '다논', '돌코리아', '빙그레', '롯데', 'OKF', '세부건망고(40G', '푸드사이언스', '비트',
    '리콜라', '크라운', '매일', '하늘', '해태', '서울', '로아카', '2080', '죽염', '해광',
    '푸르밀', '인삼공사', '파워에이드', '다우니', '반찬단지', '페이스', '건강한', '깨끗한', '칠성', '프로폴리테라',
    '일동', '시원', '맛진미채90G(냉장', '조인', '오츠카', '에스엔제이', '담터', '엔바이오', '천하', '돌',
    '예스', '20델', '정식품', '핫식스', '칭주이', '오레오', '동원', '해피바스', '물메기채45G(냉장', '아모레',
    '온더바디', '츄파춥스', '퍼펙트', '오뚜기', '페리오', '터치3', '순수고구마(130G/진공포장', '아우라', '허쉬', '해외',
    '종가집', '거림', '마그노', '하림', 'LG', '오랄비', '테크2KG(리필', '행복', '프링글스', '델리팜',
    '잘풀리는집', '굿지엔', '뉴초이스', '자숙재첩회(냉장', '비페스타', '순수한면', '리엔', '조지아', '벨라', '비락',
    '미닛메이드', '갸스비', '쏘피', '프리젤', '페브리즈', '쥬맥스', '양반', '존슨즈', 'PB', '유어스(P',
    '유어스', '글로브', '벨라민츠', '엘라스틴', '뚜또', '남양', '일화', '활황', '오늘참치못회120G(냉동', '귀애랑',
    '큐원', '농심', '오리온', '바디', '본죽', '진주햄', '이멕스', 'Y', '해아', '코카콜라(벚꽃패키지',
]

product_name_list_known = [
    '퍼퓸블랙', '트레비워터', '순수한면중형', '알로에향캔디',
    '퓨어라이프', '얼라이브청포도', '포맨', '리챔', '보성홍차밀크티',
    '티라미수초코파이', '쿨빈사워믹스', '비비고흑임자죽', '샴푸', '검은콩이들어있는우유',
    '굿나잇환', '비비빅', '존슨즈화이트후레쉬로션', '순수한면라이너', '이천쌀라뗴원컵',
    '순수한면소형', '포카리이온워터', '콘초', '듀오안플레인', '천지개벽',
    '볶음땅콩', '코카제로P', '보성꽃차', '워터젤리파인애플', '앤업돌체라떼',
    '바리스타카라멜', '풀무원샘물', '베이비로션화이트', '초미세모칫솔', '데미지클리닉트리트먼트',
    '후퍼스', '애플크럼블', '참치죽', '펭수의고저스틱', '나랑드사이다',
    '실크린스', '리콜라허브레몬', '콘앤스윗치즈', '워터젤리복숭아', '자연은망고',
    '쿨레몬맛캔디', '석류스틱', '에너지업옐로우', '핑크센세이션', '헛개파워알바린',
    '흑삼한뿌리', '밀감', '인포켓치즈', '파워씨', '파워쉐이크초코',
    '앤디스민트초콜릿', '석류콜라겐', '딸기우유', '비비고찐만두', '울트라신',
    '한라봉에이드', '한뿌리마', '스페셜티킬리만자로', '밀크스낵', '스페셜티모카',
    '바이오플레인드링킹', '간편한하루', '고래밥볶음양념', '에비앙', '레쓰비헤이즐넛',
    '갈배사이다', '찰떡쿵떡초코', '벚꽃소다', '민트초코', '야채죽',
    '애니데이무향롱', '깨끗한나라페퍼민트', '일회용면도기', '콘푸라이트밀크바', '바나나칩',
    '데자와', '내몸에순한라이너일반', '맥스봉빅소시지', '누룽지닭백숙죽', '따옴사과',
    '앤업리얼라떼', '스타일러섬유탈취_맨', '감성밀크티', '가나쵸코우유', '유기농입는오버',
    '셀렉스프로틴초코', '달고나밀크티', '요구하이', '초콜릿파르페컵', '채움오렌지',
    '깨수깡캔', '매운새우깡', '제주녹차', '바이오매실푸룬', '핫초코에몽원컵',
    '르블렌자몽히비스커스', '버터스카치라떼', '오프룻딸기알로에컵', '수퍼롱와이드', '오징어젓',
    '해보삼', '초코꿀단지', '팹시', '오렌지', '데미소다애플',
    '데미지린스', '갸스비인사드락왁스', '델몬트제주감귤', '스페셜티예가체프', '덴마크복숭아녹차',
    '케이쿨', '우유속민트초코', '친친오리지널소시지', '에너지업화이트', '순수한면오버나이트',
    '양반트러플전복죽', '핫식스더킹펀치', '젤리Ro복숭아보이차', '이프청포도', '샐러드토핑',
    '제로', '복숭아컵', '트롤리키스', '아이스쿨아카시아', '아카시아스틱꿀',
    '리츠크래커', '드링킹청포도', '무향라이너', '앤디스토피크런치', '바른아연생활',
    '환타파인PET', '내몸에순한면중', '칸타타아메리카노', '카이시우롱차', '고티카빈티지블랙',
    '스프레이', '마스터토닉워터', '멘토스레인보우', '썬업과일야채레드컵', '페레로로쉐',
    '씨솔티드카라멜', '더킹펀치', '미녀는석류를좋아해', '매콤닭강정', '울트라신환',
    '레몬민트', '%아쿠아', '냉동블루베리', '고단백에너지바', '레몬C스파클링',
    '감바스', '매콤달콤후랑크', '오프룻딸기', '정관장', '원샷킬알로에수딩젤',
    '쿠크다스화이트', '건포도', '조지아블랙캔', '레몬', '오리지널',
    '컨디션환', '마운틴듀캔', '유기농포도야채', '울날중', '미백연어마스크팩',
    '추파춥스게코젤리', '홍삼원D', '커피빈카페수아', '허브샤워물티슈캡형', '흑당밀크티',
    '자색옥수수차', '리앤웰', '프리미엄훼이셜각티슈*', '유기농린넨울날중', '유기농린넨울날대',
    '구운캐슈넛', '프링글스양파맛', '쿨민트치약', '감성아메리카노', '가나다크밀크',
    '너구리소컵', '김치찌개참치', '쿨피스파인애플바', '아카페라카라', '밀크씨슬스탁',
    '더킹파워', '치석케어치약', '찰떡쿵떡흑당', '백셀에너지드링크', '모닝파워',
    '프링글스매운맛', '양반한우사골곰탕', '제로중형', '실크샴푸', '에너지바넛츠앤베리',
    '허쉬후퍼스', '너구리큰사발', '목장딸기요구르트', '센서티브칫솔', '미키물티슈',
    '바삭은행', '웨하스딸기맛', '망고컵', '냉동과일체리', '쥬시쿨금귤에이드',
    '헛개파워', '베지밀검은콩', '유칼립투스캔디', '녹차향캔디', '포맨멘솔',
    '전복죽파우치', '쿨빈베리믹스', '질러부드러운육포', '로쉐T-', '몬스터크랩',
    '차량용맑은하늘', '쿨스피어민트캔디', '구운대파', '앤디스민트', '에너지바콘요거트',
    'UFO캔디', '고향김치만두', '에너지', '유기농무표백대형', '오가닉롱라이너',
    '시크릿울날대', '칠성사이다로어슈거', '흰우유', '보성말차P', '킨더초콜렛',
    '보양삼계죽', '유기농야채사랑', '구미당기는딸기', '페리오', '양반전복죽',
    '야생화스틱꿀', '명란크림파스타', '도티마쉬멜로초코', '직화곱창', '인포켓치즈라이트',
    '연유', '립톤밀크티', '드링킹베리믹스', '순한면슈퍼롱', '초코슈퍼콘',
    '칸타타프리미엄라떼', '게토레이레몬캔', '넛츠바디워시', '데미소다자몽', 'AURA섬유유연제',
    '채움포도', '킷캣카라멜', '덴마크레몬녹차', '왓따복숭아풍선껌', '빵판다쌀쉬폰케이크',
    '타타와초코쿠키', '네이쳐프리미엄*', '홍시에이드', '카라멜콘땅콩', '*',
    '모닝두부', '찐커피아메리카노', '냉동딸기', '눈을감자케이준', '제로오버나이트',
    '레몬클렌징폼', '시크릿쥬쥬팝핑캔디', '메가볼츠', '크런키초콜릿', '바디워시',
    '불난마늘족발', '함빛극손상케어샴푸', '제로대형', '존슨즈베이비오일', '야채스틱',
    '냉동애플망고', '바리스타로슈거', '미장센퍼펙트트리트먼트', '스프라이트익스트림P', '흑임자우유',
    '잇몸고치약', '초극세모칫솔', '비비고소고기죽', '에코슬림대형', '야채참치',
    'HEYROO크림어니언감자칩', '달고나우유', '따옴오렌지', '글라시어민트', '강릉커피라떼',
    '맛있는우유딸기', '단호박죽', '가데나미니스초콜릿', '요구르트코코', '울날대',
    '양반쇠고기미역죽', '퍼퓸샴푸', '바리스타카라멜딥프레소컵', '알리오올리오', '쇠고기죽',
    '크래프트카페라떼', '자몽메들리컵', '모구모구피치아이스', '옴팡이치약', '딸기크림',
    '도톰한오징어', '마카다미아크린베리바디워시', '네스퀵초코', '과일야채샐러드주스그린', '닭가슴살후랑크',
    '핫식스더킹스톰', '실내건조', '미셀라클렌징폼', '바닐라콘', '빠삐코',
    '헛개수EX', '컵밥참치마요덥밥', '맥스봉오리지널', '패션블랙밀착마스크', '쌍쌍바미숫가루',
    '동파육', '닥터캡슐베리믹스', '웨하스바닐라맛', 'HEYROO콘칩매콤달콤한맛', '참깨라면봉지',
    '햇반고추장제육덮밥', '검은참깨두유팩', '맛있는우유초코', '얼큰해물탕(냉동', '스페셜티마일드',
    '뉴미세모칫솔', '월드콘초코', '수박초코씨주물러', '비비고통단팥죽', '코코딸기',
    '상쾌한스틱형', '데미소다피치', '파워쉐이크곡물', '비피더스드링킹블루베리', '맛김치컵',
    '단지우유바닐라맛', '친친오리지널봉', '가데나미니스헤이즐넛', '노보콘컵스프', '찐커피카페라떼',
    '셋앤킵스프레이', '미니비엔나', 'HEYROO오리지널감자칩', '시크릿울날중', '칠성사이다복숭아캔',
    '토레타', '야채농장ABC', '타타와블루베리쿠키', '레몬타르트컵', '오랑지나',
    '카페', '칫솔', '스프라이트', '스윗만다린', '잇몸전문칫솔',
    '베지밀A병', '아라비카커피껌', '양반트러플쇠고기죽', '한입피자콤비네이션', '브라우니&바닐라',
    '메이플라떼', '딸기스파클링', '에코수퍼롱', '수박바', '유기농순면중',
    '스타일러섬유탈취_은은향', '프루팁스리치', '목편각배도라지차', '테크', '콩카페코코넛카카오',
    '게토레이레몬', '닭가슴살갈릭', '토레타P', '미장셴퍼펙트트리트먼트', '장쾌삼발효홍삼력세트',
    '화이트플로럴', '군옥수수', '트위스터칫솔', '강릉커피블랙', '함빛샴푸',
    '신라면건면사발면', '밀키스', '스팸싱글클래식', '포멜로맛캔디', '유기농대형',
    '더킹랍스터맛', '케라시스데미지린스', '페리오토탈', '카페모카컵', '비비고단호박죽',
    '유기농무표백중형', '제주녹차콘', '밤단팥죽', '체리향캔디', '바른칼슘생활',
    '양반차돌된장찌개', '델몬트오렌지', '프렌치카페카라멜컵', '실내건조세제', '츄파춥스게코젤리',
    '액티비아플레인', '센서티브미세모', '파인애플컵', '전복죽', '스타일러탈취제',
    '차량용라벤더', '간만세', '딸기꿀단지', '앵그리짜파구리큰컵', '얼라이브망고',
    '키커바', '후레쉬칫솔', '트윅스미니초콜릿', '리콜라크랜베리', '사브레',
    '유기농순면대', '보상말차라떼', '매트&하드스프레이', '듀오안사과', '빅핫바불닭구이',
    '모구모구파인아이스', '샤이닝바람개비캔디', '훈제메추리알', '인삼한뿌리', '고티카빈티지라떼',
    '빅후랑크청양고추', '프로글라이드뉴실버면도기', '스파클링복숭아', '패션쿨마스크', '이프리치',
    '우육탕면', '함빛린스', '앤요', '보솜이물티슈', '진라면매운맛큰컵',
    '아쿠아포레', '귀리우유', '퍼플스톰', '워터젤리플러스복숭아', '옵티프리렌즈액',
    '포인트딥클린스크럽폼', '잼있는사과쿠키', '내몸에순한면대', '카페베네모카', 'CVS구구콘',
    '오곡누룽지', '프링글스클래식', '가나초코바땅콩', '순한면대형', '천하장사콰트로치즈',
    '엔케이쌩쌩', '양반들깨닭죽', '데일리C레몬워터', '아쌈블랙티', '피죤액츠',
    '비피더스배', '브라질넛', '고구마깡', '샤프란핑크', '영양닭죽',
    '아몬드브리즈오리지널', '비비고버섯야채죽', '쫀득찰떡쿠키', '르블렌피치캐모마일', 'NEW컨디션환',
    '오란씨오렌지', '생초콜릿라떼', '스모크스트링치즈', '맛있는발아현미밥', '천하장사프리미엄',
    '클렌징티슈', '크림염색제흑갈색', '대구노가리', '스타벅스홍삼라떼', '오레오씬즈바닐라무스',
    '토탈', '아메리카노오리지널', '볼록맞춤중형', '유기야채농장', '커피빈헤이즐넛',
    '아메리카노캔', '오가닉코튼날중', '도티마쉬멜로요거트', '말랑이버블핸드워스', '자유시간초콜릿바',
    '멘토스포도맛', '멘토스콜라맛', '왓따콜라풍선껌', '펩시콜라', '멘토스과일',
    '립톤복숭아캔', '비비고전복죽', '흑미담은차', '인투더망고바', '골든드랍흑당밀크티',
    '의성마늘매콤왕교자', '칫솔오리지날탄력모', '오리지널초코파이', '데미지샴푸', '비피더스드링킹사과',
    '컵밥김치참치덮밥', '조지아라떼캔', '비타', '해물누룽지탕', '한끼두유팩',
    '홍삼한뿌리', 'ABC밀크초콜릿', '무표백유기농대형', '찐커피카라멜마끼아또', '립톤아이스티',
    '초코에몽', '오란씨파인', '부라보바닐라콘', '새송이쇠고기죽', '에센뽀득프랑크',
    '간편한닥터캡', '액체겸용세제', '상쾌환스틱', '순수한면대형', '초코브라우니케이크',
    '울날O/N', '딸기에몽', '치약', '아메리카노마일드', '맥스봉소시지',
    '지중해황도', '로즈바디워시', '맛있는밥', '펩시콜라캔', '프리미엄라떼캔',
    '맛있는우유커피', '데미소다청포도', '순한면중형', '킷캣헤이즐넛', '복숭아향캔디',
]

producer_name_list_known += []    # add more producer names
producer_names = set()
producer_names.update(product_name_list_known)

product_name_list_known += ['연유', '쌀로별', '치토스', '잇츠라떼', '카레']   # add more product names
product_names = set()
product_names.update(product_name_list_known)

excluded_name_list_known = ['증점품', '키핑쿠폰', '각', 'S°DA', '원']
excluded_name_list_known += []   # add more product names
excluded_names = set()
excluded_names.update(excluded_name_list_known)


import re


def is_pname(s):
    # if three consecutive chars are contained in excluded, return False
    for p in excluded_names:
        if len(s) <= 2:
            if s in p:
                return False
        else:  # more than 2 chars
            for i in range(len(s) - 2):
                if s[i:i + 3] in p:
                    return False

    # if three consecutive chars are contained in p, return True
    for p in product_names:
        if len(s) <= 2:
            if s in p:
                return True
        else:  # more than 2 chars
            for i in range(len(s) - 2):
                if s[i:i + 3] in p:
                    return True

    return False


def get_prod_name(s):
    names = re.split('\)', s)
    if names[0] not in producer_names:  # ) is a part of product name
        names = [s]

    if len(names) == 2:
        names[1] = re.sub('[\d+[\.|,]*\d+\s*\w*\s*', '', re.sub('\s', '', names[1]))

    if len(names) == 2:
        if names[0] in producer_names:
            return s
        elif is_pname(names[1]):
            return s
        else:
            return None

    if len(names) == 1:
        if is_pname(names[0]):
            return s
        return None
    return None


def get_price(s):
    price_match = re.findall('[\d*,]*\d+원', s)
    if len(price_match) == 1:
        price = int(re.sub('[,|원]', '', price_match[0]))
    else:
        price = None

    count_match = re.findall('\d+개', s)
    if len(count_match) == 1:
        count = int(re.sub('[개]', '', count_match[0]))
    else:
        count = 1

    return (count, price)


def get_event_info(s):
    event_match = re.findall('\d+\s*\+\s*\d+', s)
    if len(event_match) == 1:
        return re.sub('\s', '', event_match[0])
    else:
        return None


def get_product_info(texts):
    event_info = []
    price_info = []
    pname_info = []
    for w in texts:
        ev = get_event_info(w)
        if ev != None:
            event_info.append(ev)
            continue

        pr = get_price(w)
        if pr[1] != None:
            price_info.append(pr)
            continue

        pname = get_prod_name(w)
        if pname != None:
            pname_info.append(pname)
            continue

    return (event_info, price_info,pname_info)